# basic messages

GREETING_MESSAGE = "Привіт, я бот для парсингу каналів та чатів, враховуйте, що я буду парсити тільки {} останніх повідомлень у групі в цілях оптимізації. Окрім того для кожного юзера ми виведемо тільки {} повідомлень"
ENTER_URL = "Будь-ласка, введіть урл групи, яку будемо парсити, відсилайте один урл в повідомленні"
ENTER_NEXT_URL = "Введіть наступний урл або натисніть кнопку 'Парсити' ..."
ENTER_KEYWORDS = "Будь-ласка, введіть ключові слова за допомогою яких ми будемо парсити чат, ЧЕРЕЗ КОМИ (так, якщо, коли)..."
TRY_OTHER_URLS = "Cпробуйте інші адреси"
PARSING_CHANNEL_MESSAGE = "Парсимо групу {}, це може зайняти деякий час..."

# error messages

EMPTY_MESSAGE_ERROR = "Повідомлення не може бути пустим!"
EMPTY_URLS_ERROR = "Введіть хоч один валідний урл для парсинга!"
EMPTY_KEYWORDS_ERROR = "Введіть хоч одне ключове слово!"
BAD_URL_ERROR = "Не існує публічної групи з даною адресою!"
GROUP_ADMIN_REQUIRED_ERROR = "Для парсингу учасників групи {} потрібні права адміністратора!"
INVITE_HASH_EXPIRED_ERROR = "Група {} більше не працює або такої групи не існує!"
VALUE_ERROR = "Групи {} не існує!"